# Дана строка
my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation' 
# Делим строку по символам "запятая"
songs = my_favorite_songs.split(',')
# Выводим в консоль
print(songs[0], songs[-1], songs[1], songs[-2])

# Отлично
